# Employee Analysis using Python and libraries

In [111]:
# import Libraries
import pandas as pd

In [112]:
# read CSV using pandas
# remember : column name is case sensitive
df = pd.read_csv("Salaries.csv")

In [113]:
# List of first 5 records
df.head(5)

   rank discipline  phd  service     sex  salary
0  prof          B   56       49    Male   31500
1   hod          A   12        6  Female   25000
2  prof          B   15       30    Male   34000
3  prof          A   36       18    Male   45000
4   hod          B   31       25     NaN   37000

In [114]:
# if you want top 10 records
df.head(10)

       rank discipline  phd  service     sex  salary
0      prof          B   56       49    Male   31500
1       hod          A   12        6  Female   25000
2      prof          B   15       30    Male   34000
3      prof          A   36       18    Male   45000
4       hod          B   31       25     NaN   37000
5  lecturer          A    8       35  Female   25400

In [115]:
# last 2 records 
df.tail(2)

       rank discipline  phd  service     sex  salary
4       hod          B   31       25     NaN   37000
5  lecturer          A    8       35  Female   25400

In [116]:
# to display particular Column
df["salary"]

0    31500
1    25000
2    34000
3    45000
4    37000
5    25400
Name: salary, dtype: int64

In [117]:
# to known datatype of column
df['salary'].dtype

dtype('int64')

In [118]:
# check type of all column
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [119]:
# find total number of records in a dataframe ( 1st method)
len(df.index)

6

In [120]:
# find total number of records in a dataframe ( 2nd method) : faster then 1st method
df.shape[0]

6

In [121]:
# find total number of records in a dataframe ( 3rd method)  not recomended because its exclude NaN values
df[df.columns[4]].count()

5

In [122]:
# find total numbers of Column
df.shape[1]

6

In [123]:
# columns name
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [124]:
# calcualte standard deviation for all columns in data frame
df.std()

phd          18.250114
service      14.716204
salary     7549.944812
dtype: float64

In [126]:
#standard deviation for two columns
df.std().head(2)

phd        18.250114
service    14.716204
dtype: float64

In [129]:
#standard deviation for last columns
df.std().tail(1)

salary    7549.944812
dtype: float64

In [130]:
df['sex']

0      Male
1    Female
2      Male
3      Male
4       NaN
5    Female
Name: sex, dtype: object